In [308]:
import pandas as pd

In [309]:
# read as CSV

In [310]:
df = pd.read_csv(r'C:\Users\WIN\Downloads\Food_Attractions.csv')

In [311]:
df

,Id,City and Country,Temperature,Date,Outlook,Attraction,Food
0,1.0,"New York City, United States",71F to 59F,10/3/2024,Cloudy,Statue of Liberty,Bagel
1,2.0,"Sydney, Australia",22C to 18C,10/3/2023,Rainy,Sydney Opera House,Oyster
2,3.0,"Chicago, United States",75F to 68F,10/5/2024,Sunny,Millennium Park,Deep Dish
3,4.0,"New York City, United States",75F to 54F,10/5/2024,Sunny,Brooklyn Bridge,Pizza
4,5.0,"São Paulo, Brazil",17C to 14C,10/4/2024,Rainy,Ibirapuera Park,Feijoada
5,6.0,"Shanghai,",21C to 18C,8/7/2024,Rainy,Oriental Pearl TV Tower,Steamed Soup Dumplings
6,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7,NaN,China,NaN,NaN,NaN,NaN,NaN

In [312]:
df.dropna(inplace=True)

In [313]:
#Remove nan values

In [314]:
df.drop(df.columns[[0, 1]], axis=1, inplace=True)

In [315]:
#remove id column

In [316]:
df

,Temperature,Date,Outlook,Attraction,Food
0,71F to 59F,10/3/2024,Cloudy,Statue of Liberty,Bagel
1,22C to 18C,10/3/2023,Rainy,Sydney Opera House,Oyster
2,75F to 68F,10/5/2024,Sunny,Millennium Park,Deep Dish
3,75F to 54F,10/5/2024,Sunny,Brooklyn Bridge,Pizza
4,17C to 14C,10/4/2024,Rainy,Ibirapuera Park,Feijoada
5,21C to 18C,8/7/2024,Rainy,Oriental Pearl TV Tower,Steamed Soup Dumplings

In [317]:
#Split temps by min and max

In [337]:
df['Temperature'].str.split(pat = 'to')

0    [71F ,  59F]
1    [22C ,  18C]
2    [75F ,  68F]
3    [75F ,  54F]
4    [17C ,  14C]
5    [21C ,  18C]
Name: Temperature, dtype: object

In [339]:
df['Max Temp'] = df['Temperature'].str.split(pat = 'to').str[0]

In [341]:
df['Min Temp'] = df['Temperature'].str.split(pat = 'to').str[1]

In [343]:
df

,Temperature,Date,Outlook,Attraction,Food,Max Temp,Min Temp
0,71F to 59F,10/3/2024,Cloudy,Statue of Liberty,Bagel,71F,59F
1,22C to 18C,10/3/2023,Rainy,Sydney Opera House,Oyster,22C,18C
2,75F to 68F,10/5/2024,Sunny,Millennium Park,Deep Dish,75F,68F
3,75F to 54F,10/5/2024,Sunny,Brooklyn Bridge,Pizza,75F,54F
4,17C to 14C,10/4/2024,Rainy,Ibirapuera Park,Feijoada,17C,14C
5,21C to 18C,8/7/2024,Rainy,Oriental Pearl TV Tower,Steamed Soup Dumplings,21C,18C

In [345]:
#Drop Temperature column

In [347]:
df.drop(['Temperature']), axis = 1

SyntaxError: invalid syntax. Maybe you meant '==' or ':=' instead of '='? (2928000828.py, line 1)